HeFeiHengXing/HX_XPY_60_Software/FIRMWARE/STC89C58RD(测量板最新程序)/SECOND_SONSOR/STC89C58RD.H
										  /*--------------------------------------------------------------------------
STC89C58RD.H

Header file for generic 80C52 and STC89C58RD microcontroller.
COPYRIGHT OWNED BY LI SHAN SHOU. AT ANHUI UNIVERSITY OF ARCHITECHURE 
--------------------------------------------------------------------------*/

#ifndef __STC89C58RD_H__
#define __STC89C58RD_H__

/*  BYTE Registers  */
sfr P0    = 0x80;//+
sfr P1    = 0x90;//+
sfr P2    = 0xA0;//+
sfr P3    = 0xB0;//+
//-------------------------------
sfr P4    = 0xE8;  //p4口
//-------------------------------
sfr PSW   = 0xD0;//+
sfr ACC   = 0xE0;//+
sfr B     = 0xF0;//+
sfr SP    = 0x81;//+
sfr DPL   = 0x82;//+
sfr DPH   = 0x83;//+

sfr PCON  = 0x87;//+
sfr TCON  = 0x88;//+
sfr TMOD  = 0x89;//+
sfr TL0   = 0x8A;//+
sfr TL1   = 0x8B;//+
sfr TH0   = 0x8C;//+
sfr TH1   = 0x8D;//+
//-------------------------
sfr AUXR  = 0x8E;//辅助控制寄存器//+
sfr AUXR1  = 0xA2;//辅助控制寄存器//+
//-------------------------
sfr IE    = 0xA8;//+
sfr IP    = 0xB8;//+
//-------------------------
sfr IPH    = 0xB7;//+扩展的中断控制
sfr XICON  = 0xC0;//+
//-------------------------
sfr SCON  = 0x98;//+
sfr SBUF  = 0x99;//+
sfr SADDR = 0xA9;/////////////
sfr SADEN = 0xB9;/////////////

/*  8052 Extensions  */
sfr T2CON  = 0xC8;//+
//------------------------------
sfr T2MOD  = 0xC9;//+
//------------------------------
sfr RCAP2L = 0xCA;//+
sfr RCAP2H = 0xCB;//+
sfr TL2    = 0xCC;//+
sfr TH2    = 0xCD;//+
//=====================================
//新加的EEPROM积存器
sfr  WDT_CONTR   = 0xe1; //+

sfr  ISP_DATA    = 0xe2;//+ 
sfr  ISP_ADDRH   = 0xe3;//+
sfr  ISP_ADDRL   = 0xe4;//+
sfr  ISP_CMD     = 0xe5;//+
sfr  ISP_TRIG    = 0xe6;//+
sfr  ISP_CONTR   = 0xe7;//EEPROM操作寄存器定义
//=====================================
//**************************************
/*  BIT Registers  */
/*  PSW  */
sbit CY    = PSW^7;
sbit AC    = PSW^6;
sbit F0    = PSW^5;
sbit RS1   = PSW^4;
sbit RS0   = PSW^3;
sbit OV    = PSW^2;
sbit P     = PSW^0; //8052 only

/*  TCON  */
sbit TF1   = TCON^7;
sbit TR1   = TCON^6;
sbit TF0   = TCON^5;
sbit TR0   = TCON^4;
sbit IE1   = TCON^3;
sbit IT1   = TCON^2;
sbit IE0   = TCON^1;
sbit IT0   = TCON^0;

/*  IE  */
sbit EA    = IE^7;
sbit ET2   = IE^5; //8052 only
sbit ES    = IE^4;
sbit ET1   = IE^3;
sbit EX1   = IE^2;
sbit ET0   = IE^1;
sbit EX0   = IE^0;
//===============================
/* XICON */
sbit PX3 =XICON^7;
sbit EX3 =XICON^6;
sbit IE3 =XICON^5;
sbit IT3 =XICON^4;
sbit PX2 =XICON^3;
sbit EX2 =XICON^2;
sbit IE2 =XICON^1;
sbit IT2 =XICON^0;
//===============================
/*  IP  */
sbit PT2   = IP^5;
sbit PS    = IP^4;
sbit PT1   = IP^3;
sbit PX1   = IP^2;
sbit PT0   = IP^1;
sbit PX0   = IP^0;

/*  P3  */
sbit RD    = P3^7;
sbit WR    = P3^6;
sbit T1    = P3^5;
sbit T0    = P3^4;
sbit INT1  = P3^3;
sbit INT0  = P3^2;
sbit TXD   = P3^1;
sbit RXD   = P3^0;

/*  SCON  */
sbit SM0   = SCON^7;
sbit SM1   = SCON^6;
sbit SM2   = SCON^5;
sbit REN   = SCON^4;
sbit TB8   = SCON^3;
sbit RB8   = SCON^2;
sbit TI    = SCON^1;
sbit RI    = SCON^0;

/*  P1  */
sbit T2EX  = P1^1; // 8052 only
sbit T2    = P1^0; // 8052 only
             
/*  T2CON  */
sbit TF2    = T2CON^7;
sbit EXF2   = T2CON^6;
sbit RCLK   = T2CON^5;
sbit TCLK   = T2CON^4;
sbit EXEN2  = T2CON^3;
sbit TR2    = T2CON^2;
sbit C_T2   = T2CON^1;
sbit CP_RL2 = T2CON^0;
//************************************************************************
//************************************************************************
//===================================
//电路板端口定义区
sbit  LED_SDI=P3^2;
sbit  LED_CLK=P3^3;
sbit  LED_LE =P3^4;//锁存信号

sbit  LED1_OE=P1^6;//低电平有效
sbit  LED2_OE=P1^5;

//sbit  LED3_OE=P3^3;
//sbit  LED4_OE=P3^4;
//======================================

//***********************************************************************
//***********************************************************************
sbit  TCS_S2=P3^6;
sbit  TCS_S3=P3^7;//
sbit  TCS_OUT=P3^5;//用定时器1作为外部脉冲记数器，定时器0作为定时器使用，在调白平衡时用

//传感器输出控制
sbit  TCS_OE1=P4^0;

sbit  TCS_OE2=P2^0;//
sbit  TCS_OE3=P2^1;
sbit  TCS_OE4=P2^2;//
sbit  TCS_OE5=P2^3;
sbit  TCS_OE6=P2^4;//
sbit  TCS_OE7=P2^5;
sbit  TCS_OE8=P2^6;//
sbit  TCS_OE9=P2^7;

sbit  TCS_OE10=P4^1;//
sbit  TCS_OE11=P1^0;
sbit  TCS_OE12=P4^2;//

sbit  TCS_OE13=P0^0;
sbit  TCS_OE14=P0^1;//
sbit  TCS_OE15=P0^2;
sbit  TCS_OE16=P0^3;//
sbit  TCS_OE17=P0^4;
sbit  TCS_OE18=P0^5;//
sbit  TCS_OE19=P0^6;
sbit  TCS_OE20=P0^7;//

//==============================
sbit  DIR_485=P4^3;//==0SHOU  ==1FA
//*************************************************************************
//*************************************************************************
#endif
